/**********************************************************************************************************
*
*	模块名称 : ADC采集
*	文件名称 : bsp_adc.c
*	版    本 : V1.0
*	说    明 : 
*
*	修改记录 :
*		版本号  日期             作者              说明
*		V1.0    2022-04-08   
*
**********************************************************************************************************/
#include "gd32f10x_it.h"
#include "bsp.h"
#include "user.h"

/*********************************************************************************************************
*                                            宏定义
**********************************************************************************************************/
#define EE_PAGE_SIZE		16			/* 页面大小 */
#define EE_DEV_ADDR			0xA0		/* 设备地址 */
#define EE_WR	            0		    /* 写控制位 */
#define EE_RD	            1		    /* 读控制位 */

/* 定义EEPROM器件GPIO端口*/
#define EE_GPIO_PORT	GPIOB				/* GPIO端口 */
#define SCL_PIN		    GPIO_PIN_10			/* 连接到SCL时钟线的GPIO */
#define SDA_PIN		    GPIO_PIN_11		
/* 连接到SDA数据线的GPIO */

#define SCL_HIGH()   GPIO_BOP(EE_GPIO_PORT) = (uint32_t)SCL_PIN				/* SCL = 1 */
#define SCL_LOW()    GPIO_BC(EE_GPIO_PORT) = (uint32_t)SCL_PIN				/* SCL = 0 */

#define SDA_HIGH()   GPIO_BOP(EE_GPIO_PORT) = (uint32_t)SDA_PIN				/* SDA = 1 */
#define SDA_LOW()    GPIO_BC(EE_GPIO_PORT) = (uint32_t)SDA_PIN				/* SDA = 0 */

#define SDA_READ()   ((uint32_t)RESET !=(GPIO_ISTAT(EE_GPIO_PORT) & (SDA_PIN)))		/* 读SDA端口状态 */


/*********************************************************************************************************
*                                            变量定义
**********************************************************************************************************/


/*********************************************************************************************************
*	函 数 名: EE_Delay
*	功能说明: 延时
*	形    参: 无
*	返 回 值: 无********************************************************************************************************
*/
static void EE_Delay(void)
{
	delay_us(10);
}


/*********************************************************************************************************
*	函 数 名: EE_Start
*	功能说明: I2C 起始信号
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************/
void EE_Start(void)
{
	/* 当 SCL 高电平时，SDA 出现一个下跳沿表示 I2C 总线起始信号 */
	SDA_HIGH();
	SCL_HIGH();
	EE_Delay();
	SDA_LOW();
	EE_Delay();	
	SCL_LOW();
	EE_Delay();
}

/*********************************************************************************************************
*	函 数 名: EE_Stop
*	功能说明: I2C 停止信号
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************/
void EE_Stop(void)
{
	/* 当 SCL 高电平时，SDA 出现一个上跳沿表示 I2C 总线结束信号 */
	SDA_LOW();
	SCL_HIGH();
	EE_Delay();
	SDA_HIGH();
	EE_Delay();	
}


/*********************************************************************************************************
*	函 数 名: EE_SendByte
*	功能说明: 向 I2C 总线发送一个字节的数据
*	形    参: _ucByte     要发送的数据
*	返 回 值: 无
*********************************************************************************************************/
void EE_SendByte(uint8_t _ucByte)
{
	uint8_t i;

	/* 先发送字节的高位 bit7 */
	for (i = 0; i < 8; i++)
	{
		if (_ucByte & 0x80)
		{
			SDA_HIGH();
		}
		else
		{
			SDA_LOW();
		}
		EE_Delay();
		SCL_HIGH();
		EE_Delay();
		SCL_LOW();
		if (i == 7)
		{
			 SDA_HIGH(); /* 释放总线 */ 
		}
		_ucByte <<= 1;	/* 左移一位 */ 
		EE_Delay();
	}
}


/*********************************************************************************************************
*	函 数 名: EE_ReadByte
*	功能说明: 读取 I2C 总线上一个字节的数据
*	形    参: 无
*	返 回 值: 读取到的数据
*********************************************************************************************************/
uint8_t EE_ReadByte(void)
{
	uint8_t i;
	uint8_t ucByte = 0;

	/* 读到第 1 个 bit 为数据的 bit7 */
	for(i = 0; i < 8; i++)
	{
		ucByte <<= 1;
		SCL_HIGH();
		EE_Delay();
		if(SDA_READ())
		{
			ucByte++;
		}
		SCL_LOW();
		EE_Delay();
	}
	return ucByte;
}



/*********************************************************************************************************
*	函 数 名: EE_WaitAck
*	功能说明: 等待 I2C 总线应答信号
*	形    参: 无
*	返 回 值: 返回 1 ，无应答；返回 0 ，应答
*********************************************************************************************************/
uint8_t EE_WaitAck(void)
{
	uint8_t re;

	SDA_HIGH();	/* CPU 释放 SDA 线 */
	EE_Delay();
	SCL_HIGH();	/* CPU 驱动 SCL = 1, 此时器件会返回 ACK 应答 */
	EE_Delay();
	if(SDA_READ())
	{	
		re = 1;
	}
	else
	{
		re = 0;
	}
	SCL_LOW();
	EE_Delay();
	return re;
}


/*********************************************************************************************************
*	函 数 名: EE_Ack
*	功能说明: MCU 产生一个应答信号
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************/
void EE_Ack(void)
{
	SDA_LOW();	/* CPU 驱动 SDA = 0 */
	EE_Delay();
	SCL_HIGH();	/* CPU 产生 1 个时钟 */
	EE_Delay();
	SCL_LOW();
	EE_Delay();
	SDA_HIGH();	/* CPU 释放 SDA 总线 */	
}

/*********************************************************************************************************
*	函 数 名: EE_NAck
*	功能说明: CPU 不产生应答信号
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************/
void EE_NAck(void)
{
	SDA_HIGH();	/* CPU 驱动 SDA = 1 */
	EE_Delay();
	SCL_HIGH();	/* CPU 产生 1 个时钟 */
	EE_Delay();
	SCL_LOW();
	EE_Delay();
}


/*********************************************************************************************************
*	函 数 名: read_eeprom
*	功能说明: EEPROM读取数据
*	形    参: 
*	返 回 值: 
*********************************************************************************************************/
uint8_t read_eeprom(uint8_t *_ucpBuf, uint16_t _usAddress, uint16_t _usSize)
{
    uint16_t i;

	EE_Start(); 	/* 起始信号 */

	EE_SendByte(EE_DEV_ADDR  + ((_usAddress >> 8) << 1));

	if (EE_WaitAck() != 0)  /* 等待应答信号 */
	{
		goto cmd_fail;	
	}

	/* 发送字节地址，24c04以上需要发送多个地址 */
	EE_SendByte(_usAddress & 0xFF);
	
	if (EE_WaitAck() != 0)	/* 等待应答信号 */
	{
		goto cmd_fail;
	}
	
	EE_Start();	/* 重新启动总线，开始读取数据 */

    EE_SendByte(EE_DEV_ADDR | EE_RD );
	
	if (EE_WaitAck() != 0)	/* 等待应答信号 */
	{
		goto cmd_fail;
	}

	for (i = 0; i < _usSize; i++)	/* 循环读取数据 */
	{
		_ucpBuf[i] = EE_ReadByte();	/* 读取一个字节 */

		if (i != _usSize - 1)
		{
			EE_Ack();	/* 中间字节读完后，CPU产生ACK信号（驱动SDA = 0） */
		}
		else
		{
			EE_NAck();	/* 最后一个字节读完后，CPU产生NACK信号（驱动SDA = 1）*/
		}
	}
	/* ·发送停止信号 */
	EE_Stop();
	
	return 1;	/* 执行成功 */

	cmd_fail: /* 命令失败后，发送停止信号，避免影响总线上的其他设备 */
	/* 发送停止命令 */
	EE_Stop();
	return 0;
}

/*********************************************************************************************************
*	函 数 名: write_eeprom
*	功能说明: EEPROM读取数据
*	形    参: 
*	返 回 值: 
*********************************************************************************************************/
uint8_t write_eeprom(uint8_t *_ucpBuf, uint16_t _usAddress, uint16_t _usSize)
{
	uint16_t i, m;
	uint16_t usAddr;

	usAddr = _usAddress;
	for (i = 0; i < _usSize; i++)
	{
		/* 当发送第一个字节或是页面首地址时，需要重新发送启动信号和地址 */
		if ((i == 0) || (usAddr & (EE_PAGE_SIZE - 1)) == 0)
		{
			EE_Stop();

			for (m = 0; m < 1000; m++)
			{
				EE_Start();	/* 起始信号 */
				
				EE_SendByte(EE_DEV_ADDR + ((usAddr >> 8) << 1));
				if (EE_WaitAck() == 0)	/* 等待应答信号 */
				{
					break;
				}
			}
			if (m  == 1000)
			{
				goto cmd_fail;	/* EEPROM 器件写超时*/
			}

			/* 发送地址 */
			EE_SendByte(usAddr & 0xFF);
			
			if (EE_WaitAck() != 0)	/* 等待应答信号 */
			{
				goto cmd_fail;	
			}
		}

		/* 开始写入数据 */
		EE_SendByte(_ucpBuf[i]);

		if (EE_WaitAck() != 0)	/* 等待应答信号 */
		{
			goto cmd_fail;	
		}

		usAddr++;	/* 地址增1 */
	}
	/* 发送停止信号 */
	EE_Stop();
	
	return 1;	/* 执行成功 */

	cmd_fail: /* 命令失败后，发送停止信号，避免影响总线上的其他设备 */
	/* 发送停止信号 */
	EE_Stop();
	return 0;
}

/*********************************************************************************************************
*	函 数 名: set_eeprom
*	功能说明: EEPROM读取数据
*	形    参: 
*	返 回 值: 
*********************************************************************************************************/
uint8_t set_eeprom(uint8_t _ucBuf, uint16_t _usAddress, uint16_t _usSize)
{
	uint16_t i, m;
	uint16_t usAddr;

	usAddr = _usAddress;
	for (i = 0; i < _usSize; i++)
	{
		/* 当发送第一个字节或是页面首地址时，需要重新发送启动信号和地址 */
		if ((i == 0) || (usAddr & (EE_PAGE_SIZE - 1)) == 0)
		{
			EE_Stop();

			for (m = 0; m < 1000; m++)
			{
				EE_Start();	/*起始信号 */
				
                EE_SendByte(EE_DEV_ADDR + ((usAddr >> 8) << 1));
                
				if (EE_WaitAck() == 0)	/* 等待应答信号 */
				{
					break;
				}
			}
			if (m  == 1000)
			{
				goto cmd_fail;	/* EEPROM器件写超时 */
			}

			/* 发送地址 */
			EE_SendByte(usAddr & 0xFF);	
			
			if (EE_WaitAck() != 0)	/* 等待应答信号 */
			{
				goto cmd_fail;	
			}
		}

		/* 开始写入数据 */
		EE_SendByte(_ucBuf);

		if (EE_WaitAck() != 0)	/* 等待应答信号 */
		{
			goto cmd_fail;	
		}

		usAddr++;	/* 地址增1 */
	}
	/* 发送停止信号 */
	EE_Stop();
	
	return 1;	/* 执行成功 */

cmd_fail: /* 命令失败后，发送停止信号，避免影响总线上的其他设备 */
	/* 发送停止信号 */
	EE_Stop();
	return 0;
}

/*********************************************************************************************************
*	函 数 名: BSP_EEPROM_Init
*	功能说明: 
*	形    参: 
*	返 回 值: 
*********************************************************************************************************/
void BSP_EEPROM_Init(void)
{
    rcu_periph_clock_enable(RCU_GPIOB);
	
	gpio_init(EE_GPIO_PORT, GPIO_MODE_OUT_OD, GPIO_OSPEED_50MHZ, SCL_PIN | SDA_PIN);  /* 初始化IO */
	
	EE_Stop();
}









